fio-plugin-log/randwrite/fio-plugin_randwrite_8ssd_128qd.log
test: (g=0): rw=randwrite, bs=4096B-4096B,4096B-4096B,4096B-4096B, ioengine=spdk, iodepth=128
fio-2.18
Starting 1 thread
Starting DPDK 17.05.0 initialization...
[ DPDK EAL parameters: fio -c 0x1 -m 512 --file-prefix=spdk_pid25098 ]
EAL: Probing VFIO support...
EAL: PCI device 0000:83:00.0 on NUMA socket 1
EAL:   probe driver: 8086:953 spdk_nvme
EAL: PCI device 0000:84:00.0 on NUMA socket 1
EAL:   probe driver: 8086:953 spdk_nvme
EAL: PCI device 0000:86:00.0 on NUMA socket 1
EAL:   probe driver: 8086:953 spdk_nvme
EAL: PCI device 0000:88:00.0 on NUMA socket 1
EAL:   probe driver: 8086:953 spdk_nvme
EAL: PCI device 0000:89:00.0 on NUMA socket 1
EAL:   probe driver: 8086:953 spdk_nvme

fio: terminating on signal 2

fio: terminating on signal 2

test: (groupid=0, jobs=1): err= 0: pid=25145: Wed Jul 12 02:30:04 2017
  write: IOPS=1035k, BW=4042MiB/s (4239MB/s)(137GiB/34637msec)
    slat (usec): min=0, max=17, avg= 0.04, stdev= 0.19
    clat (usec): min=5, max=24347, avg=123.14, stdev=281.47
     lat (usec): min=5, max=24348, avg=123.18, stdev=281.47
    clat percentiles (usec):
     |  1.00th=[    7],  5.00th=[    7], 10.00th=[    8], 20.00th=[    9],
     | 30.00th=[   10], 40.00th=[   11], 50.00th=[   13], 60.00th=[   17],
     | 70.00th=[   24], 80.00th=[  169], 90.00th=[  502], 95.00th=[  516],
     | 99.00th=[ 1012], 99.50th=[ 1544], 99.90th=[ 3088], 99.95th=[ 4128],
     | 99.99th=[ 6048]
    lat (usec) : 10=26.98%, 20=37.68%, 50=11.86%, 100=2.17%, 250=2.39%
    lat (usec) : 500=8.09%, 750=9.44%, 1000=0.38%
    lat (msec) : 2=0.71%, 4=0.25%, 10=0.05%, 20=0.01%, 50=0.01%
  cpu          : usr=99.84%, sys=0.02%, ctx=13, majf=0, minf=23512
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=0,35843430,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=4042MiB/s (4239MB/s), 4042MiB/s-4042MiB/s (4239MB/s-4239MB/s), io=137GiB (147GB), run=34637-34637msec